src/EnergyConsumption/EnergyConsumptionPortType.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}. -->
<definitions targetNamespace="http://EnergyConsumption/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://EnergyConsumption/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://EnergyConsumption/" schemaLocation="EnergyConsumptionPortType_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="Calculate">
    <part name="parameters" element="tns:Calculate"/>
  </message>
  <message name="CalculateResponse">
    <part name="parameters" element="tns:CalculateResponse"/>
  </message>
  <portType name="EnergyConsumption">
    <operation name="Calculate">
      <input ns1:Action="http://EnergyConsumption/EnergyConsumption/CalculateRequest" message="tns:Calculate" xmlns:ns1="http://www.w3.org/2007/05/addressing/metadata"/>
      <output ns2:Action="http://EnergyConsumption/EnergyConsumption/CalculateResponse" message="tns:CalculateResponse" xmlns:ns2="http://www.w3.org/2007/05/addressing/metadata"/>
    </operation>
  </portType>
</definitions>

